export default [
    {
        "id": 1,
        "name": "金字塔",
        "pid": "0",
        "childs": [
            {
                "id": 2,
                "name": "金字塔1",
                "pid": "1",
                "childs": [
                    {
                        "id": 5,
                        "name": "金字塔1-1",
                        "pid": "2",
                        "childs": [
                            {
                                "id": 8,
                                "name": "金字塔1-1-1",
                                "pid": "5",
                                "childs": [
                                    {
                                        "id": 10,
                                        "name": "金字塔1-1-1-1",
                                        "pid": "8",
                                        "childs": [
                                            {
                                                "id": 28,
                                                "name": "金字塔1-1-1-1-1",
                                                "pid": "10",
                                                "childs": [
                                                    {
                                                        "id": 29,
                                                        "name": "金字塔1-1-1-1-1-1",
                                                        "pid": "28",
                                                        "childs": [
                                                            {
                                                                "id": 30,
                                                                "name": "金字塔1-1-1-1-1-1-1",
                                                                "pid": "29"
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "id": 18,
                                "name": "金字塔1-1-2",
                                "pid": "5",
                                "childs": [
                                    {
                                        "id": 31,
                                        "name": "金字塔1-1-2-1",
                                        "pid": "18",
                                        "childs": [
                                            {
                                                "id": 32,
                                                "name": "金字塔1-1-2-1-1",
                                                "pid": "31",
                                                "childs": [
                                                    {
                                                        "id": 33,
                                                        "name": "金字塔1-1-2-1-1-1",
                                                        "pid": "32"
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "id": 11,
                        "name": "金字塔1-2",
                        "pid": "2",
                        "childs": [
                            {
                                "id": 12,
                                "name": "金字塔1-2-1",
                                "pid": "11",
                                "childs": [
                                    {
                                        "id": 13,
                                        "name": "金字塔1-2-1-1",
                                        "pid": "12"
                                    },
                                    {
                                        "id": 17,
                                        "name": "金字塔1-2-1-1",
                                        "pid": "12"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "id": 3,
                "name": "金字塔2",
                "pid": "1",
                "childs": [
                    {
                        "id": 6,
                        "name": "金字塔2-1",
                        "pid": "3",
                        "childs": [
                            {
                                "id": 9,
                                "name": "金字塔2-1-1",
                                "pid": "6",
                                "childs": [
                                    {
                                        "id": 19,
                                        "name": "金字塔2-1-1-1",
                                        "pid": "9"
                                    },
                                    {
                                        "id": 20,
                                        "name": "金字塔2-1-1-2",
                                        "pid": "9"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "id": 14,
                        "name": "金字塔2-2",
                        "pid": "3"
                    },
                    {
                        "id": 15,
                        "name": "金字塔2-3",
                        "pid": "3"
                    },
                    {
                        "id": 16,
                        "name": "金字塔2-4",
                        "pid": "3"
                    }
                ]
            }
        ]
    }
]